tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
brew "autossh"
brew "fzf"
brew "git"
brew "git-open"
brew "gmp"
brew "gnupg"
brew "gnutls"
brew "grep"
brew "htop"
brew "jq"
brew "mas"
brew "ncdu"
brew "neofetch"
brew "python3"
brew "tmux"
brew "tree"
brew "vim"
brew "zsh"
cask "alt-tab"
cask "discord"
cask "docker"
cask "flux"
cask "google-chrome"
cask "hiddenbar"
cask "iterm2"
cask "notion"
cask "notunes"
cask "ranger"
cask "raycast"
cask "rectangle"
cask "slack"
cask "ticktick"
cask "visual-studio-code"
cask "zoom"
mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147