brew "autossh" # Keeps SSH sessions/tunnels alive; auto-restarts on failure
brew "bat" # Cat alternative with syntax highlighting, git integration, paging
brew "fd"
brew "fzf" # Command-line fuzzy finder for files, history, processes, etc.
brew "git"
brew "git-delta" # Git diff viewer with syntax highlighting, git integration, paging
brew "git-open" # Opens the current repo/branch in your browser from the CLI
brew "grep"
brew "htop" # Interactive process viewer/manager
brew "jq"
brew "mas" # Mac App Store CLI (search, install, update MAS apps)
brew "ncdu"
brew "neofetch" #  System info display (OS, kernel, CPU, RAM) in the terminal
brew "python3"
brew "ranger"
brew "ripgrep"
brew "tmux"
brew "tree"
brew "vim"
brew "zoxide"
brew "zsh"

cask "alt-tab"
cask "discord"
cask "docker"
cask "flux"
cask "google-chrome"
cask "hiddenbar"
cask "iterm2"
cask "notion"
cask "notunes"
cask "ranger"
cask "raycast"
cask "rectangle"
cask "slack"
cask "ticktick"
cask "visual-studio-code"
cask "zoom"

mas "Amphetamine", id: 937984704
mas "Bitwarden", id: 1352778147
